from controller import Controller

def main():
    ctl = Controller()
    ctl.run()


if __name__ == '__main__':
    main()


# C:\Users\Dmitry\Scripts\HomeWork\venv\Scripts\python.exe C:/Users/Dmitry/Scripts/HomeWork/films/project_films.py
# ===== Редактирование данных каталога фильмов =====
# Действия с фильмами:
# 1 - добавление фильма
# 2 - каталог фильмов
# 3 - просмотр определённого фильма
# 4 - удаление фильма
# q - выход из программы
# Выберите вариант действия: 1
# ==================================================
# =============== Добавление фильма ================
# Введите название фильма: Утомлённые солнцем
# Введите жанр фильма: Драма
# Введите режиссёр фильма: Н. Михалков
# Введите год выпуска фильма: 1994
# Введите длительность фильма: 145 мин
# Введите студия фильма: Мосфильм, Camera One
# Введите актёры фильма: О.Меньшиков, Н. Михалков, Ингеборга, Дапкунайте
# ==================================================
# ===== Редактирование данных каталога фильмов =====
# Действия с фильмами:
# 1 - добавление фильма
# 2 - каталог фильмов
# 3 - просмотр определённого фильма
# 4 - удаление фильма
# q - выход из программы
# Выберите вариант действия: 1
# ==================================================
# =============== Добавление фильма ================
# Введите название фильма: Охота на пиранью
# Введите жанр фильма: Боевик, Триллер
# Введите режиссёр фильма: Андрей Кавун
# Введите год выпуска фильма: 2006
# Введите длительность фильма: 125 мин
# Введите студия фильма: Россия - 1
# Введите актёры фильма: В. Машков, Е. Миронов, С. Антонова, В. Исакова, А. Мерзликин
# ==================================================
# ===== Редактирование данных каталога фильмов =====
# Действия с фильмами:
# 1 - добавление фильма
# 2 - каталог фильмов
# 3 - просмотр определённого фильма
# 4 - удаление фильма
# q - выход из программы
# Выберите вариант действия: 1
# ==================================================
# =============== Добавление фильма ================
# Введите название фильма: Рэмбо первая кровь
# Введите жанр фильма: Экшн, драма
# Введите режиссёр фильма: Т. Котчефф
# Введите год выпуска фильма: 1982
# Введите длительность фильма: 93 мин
# Введите студия фильма: Anabasis
# Введите актёры фильма: С. Сталлоне, Р. Креннаб Б. Деннехи
# ==================================================
# ===== Редактирование данных каталога фильмов =====
# Действия с фильмами:
# 1 - добавление фильма
# 2 - каталог фильмов
# 3 - просмотр определённого фильма
# 4 - удаление фильма
# q - выход из программы
# Выберите вариант действия: 2
# ==================================================
# ================ Каталог фильмов =================
# 1. ф2 (а)
# 2. Утомлённые солнцем (Драма)
# 3. Охота на пиранью (Боевик, Триллер)
# 4. Рэмбо первая кровь (Экшн, драма)
# ==================================================
# ===== Редактирование данных каталога фильмов =====
# Действия с фильмами:
# 1 - добавление фильма
# 2 - каталог фильмов
# 3 - просмотр определённого фильма
# 4 - удаление фильма
# q - выход из программы
# Выберите вариант действия: 4
# ==================================================
# ============== Ввод названия фильма ==============
# Введите название фильма: ф2
# ==================================================
# ================ Удаление фильма =================
# Фильм ф2 (а) - был удалён
# ==================================================
# ===== Редактирование данных каталога фильмов =====
# Действия с фильмами:
# 1 - добавление фильма
# 2 - каталог фильмов
# 3 - просмотр определённого фильма
# 4 - удаление фильма
# q - выход из программы
# Выберите вариант действия: 2
# ==================================================
# ================ Каталог фильмов =================
# 1. Утомлённые солнцем (Драма)
# 2. Охота на пиранью (Боевик, Триллер)
# 3. Рэмбо первая кровь (Экшн, драма)
# ==================================================
# ===== Редактирование данных каталога фильмов =====
# Действия с фильмами:
# 1 - добавление фильма
# 2 - каталог фильмов
# 3 - просмотр определённого фильма
# 4 - удаление фильма
# q - выход из программы
# Выберите вариант действия: 3
# ==================================================
# ============== Ввод названия фильма ==============
# Введите название фильма: Охота на пиранью
# ==================================================
# ================ Просмотр фильма =================
# название фильма Охота на пиранью
# жанр фильма Боевик, Триллер
# продюсер фильма Андрей Кавун
# год выпуска фильма 2006
# длительность фильма 125 мин
# студия фильма Россия - 1
# актёры фильма В. Машков, Е. Миронов, С. Антонова, В. Исакова, А. Мерзликин
# ==================================================
# ===== Редактирование данных каталога фильмов =====
# Действия с фильмами:
# 1 - добавление фильма
# 2 - каталог фильмов
# 3 - просмотр определённого фильма
# 4 - удаление фильма
# q - выход из программы
# Выберите вариант действия: 3
# ==================================================
# ============== Ввод названия фильма ==============
# Введите название фильма: Невезучие
# ==================================================
# ============== Сообщение об ошибке ===============
# Фильма с пазванием Невезучие не существует
# ==================================================
# ===== Редактирование данных каталога фильмов =====
# Действия с фильмами:
# 1 - добавление фильма
# 2 - каталог фильмов
# 3 - просмотр определённого фильма
# 4 - удаление фильма
# q - выход из программы
# Выберите вариант действия: q
# ==================================================
#
# Process finished with exit code 0
